package main.java.com.AlexParchuk.javacore.chapter09.interfaces;

/**Чтобы реализовать интерфейс, в определение класса требуется включить выражение implements,
 * а затем создать методы, определенные в интерфейсе.
 *
 * доступ class имя_класса [extends суперкласс]
 * [implements интерфейс [, интерфейс ... ]]
 *
 *Методы, реализующие элементы интерфейса, должны быть объявлены как public.
 *Если метод реализуется из интерфейса, он должен быть объявлен как public.
 *
 * Если класс включает в себя интерфейс, но не полностью реализует определенные
 * в нем методы, он должен быть объявлен как abstract
 *
 * Каждый класс, который включает в себя интерфейс, должен реализовать все его методы.
 *
 * В объявлениях интерфейсов
 * могут быть объявлены переменные. Они неявно объявляются как fina1 и stаtiс
 *
 * Переменные можно объявлять как ссылки на объекты, в которых используется
 * тип интерфейса, а не тип класса.
 *
 * В начале объявления метода с реализацией по умолчанию указывается ключевое слово default.
 *
 */

public class Interfaces {


}
